cf_billing/Catalogs/энргФормулыРасчетаНорматива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргФормулыРасчетаНорматива</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХэшСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчетаНормативаПотребления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчетаНормативаПотребленияПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСхемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыСхемТеплоснабжения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТепловогоПункта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыТепловыхПунктов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргФормулыРасчетаНорматива/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ФормулаРасчетаНормативаПотребленияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СоставУслуги 				= Новый Массив;
	Для Каждого СтрокаСостава Из Объект.Услуги Цикл
		СоставУслуги.Добавить(СтрокаСостава.Услуга);
	КонецЦикла; 	
		
	Оповещение 					= Новый ОписаниеОповещения("НастройкаФормулыРасчетаЗавершение",ЭтаФорма,Новый Структура);
	ПараметрыФормы 				= Новый Структура;
	ПараметрыФормы.Вставить("Услуга", 					Объект.Ссылка);
	ПараметрыФормы.Вставить("СоставУслуги", 			СоставУслуги);
	ПараметрыФормы.Вставить("ОДН", 						Истина);
	ПараметрыФормы.Вставить("ПредставлениеФормулы", 	Объект.ФормулаРасчетаНормативаПотребленияПредставление);
	
	ОткрытьФорму("ОбщаяФорма.энргНастройкаФормулРасчета",ПараметрыФормы,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаФормулыРасчетаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РезультатЗакрытия.Свойство("ПредставлениеФормулы") ИЛИ Не РезультатЗакрытия.Свойство("ФормулаРасчета") Тогда
		Возврат;
	КонецЕсли;
		
	Объект.ФормулаРасчетаНормативаПотребленияПредставление 	= РезультатЗакрытия.ПредставлениеФормулы;
	Объект.ФормулаРасчетаНормативаПотребления 				= РезультатЗакрытия.ФормулаРасчета;
		
КонецПроцедуры

#КонецОбласти
